RIOT-OS/RIOT/cpu/efm32/families/efm32gg12b/include/vendor/efm32gg12b_devinfo.h
/* Bit fields for DEVINFO CSENGAINCAL */
#define _DEVINFO_CSENGAINCAL_MASK                                0x000000FFUL /**< Mask for DEVINFO_CSENGAINCAL */
#define _DEVINFO_CSENGAINCAL_GAINCAL_SHIFT                       0            /**< Shift value for GAINCAL */
#define _DEVINFO_CSENGAINCAL_GAINCAL_MASK                        0xFFUL       /**< Bit mask for GAINCAL */

/* Bit fields for DEVINFO USHFRCOCAL7 */
#define _DEVINFO_USHFRCOCAL7_MASK                                0xFFFF3F7FUL /**< Mask for DEVINFO_USHFRCOCAL7 */
#define _DEVINFO_USHFRCOCAL7_TUNING_SHIFT                        0            /**< Shift value for TUNING */
#define _DEVINFO_USHFRCOCAL7_TUNING_MASK                         0x7FUL       /**< Bit mask for TUNING */
#define _DEVINFO_USHFRCOCAL7_FINETUNING_SHIFT                    8            /**< Shift value for FINETUNING */
#define _DEVINFO_USHFRCOCAL7_FINETUNING_MASK                     0x3F00UL     /**< Bit mask for FINETUNING */
#define _DEVINFO_USHFRCOCAL7_FREQRANGE_SHIFT                     16           /**< Shift value for FREQRANGE */
#define _DEVINFO_USHFRCOCAL7_FREQRANGE_MASK                      0x1F0000UL   /**< Bit mask for FREQRANGE */
#define _DEVINFO_USHFRCOCAL7_CMPBIAS_SHIFT                       21           /**< Shift value for CMPBIAS */
#define _DEVINFO_USHFRCOCAL7_CMPBIAS_MASK                        0xE00000UL   /**< Bit mask for CMPBIAS */
#define _DEVINFO_USHFRCOCAL7_LDOHP_SHIFT                         24           /**< Shift value for LDOHP */
#define _DEVINFO_USHFRCOCAL7_LDOHP_MASK                          0x1000000UL  /**< Bit mask for LDOHP */
#define _DEVINFO_USHFRCOCAL7_CLKDIV_SHIFT                        25           /**< Shift value for CLKDIV */
#define _DEVINFO_USHFRCOCAL7_CLKDIV_MASK                         0x6000000UL  /**< Bit mask for CLKDIV */
#define _DEVINFO_USHFRCOCAL7_FINETUNINGEN_SHIFT                  27           /**< Shift value for FINETUNINGEN */
#define _DEVINFO_USHFRCOCAL7_FINETUNINGEN_MASK                   0x8000000UL  /**< Bit mask for FINETUNINGEN */
#define _DEVINFO_USHFRCOCAL7_VREFTC_SHIFT                        28           /**< Shift value for VREFTC */
#define _DEVINFO_USHFRCOCAL7_VREFTC_MASK                         0xF0000000UL /**< Bit mask for VREFTC */

/* Bit fields for DEVINFO USHFRCOCAL11 */
#define _DEVINFO_USHFRCOCAL11_MASK                               0xFFFF3F7FUL /**< Mask for DEVINFO_USHFRCOCAL11 */
#define _DEVINFO_USHFRCOCAL11_TUNING_SHIFT                       0            /**< Shift value for TUNING */
#define _DEVINFO_USHFRCOCAL11_TUNING_MASK                        0x7FUL       /**< Bit mask for TUNING */
#define _DEVINFO_USHFRCOCAL11_FINETUNING_SHIFT                   8            /**< Shift value for FINETUNING */
#define _DEVINFO_USHFRCOCAL11_FINETUNING_MASK                    0x3F00UL     /**< Bit mask for FINETUNING */
#define _DEVINFO_USHFRCOCAL11_FREQRANGE_SHIFT                    16           /**< Shift value for FREQRANGE */
#define _DEVINFO_USHFRCOCAL11_FREQRANGE_MASK                     0x1F0000UL   /**< Bit mask for FREQRANGE */
#define _DEVINFO_USHFRCOCAL11_CMPBIAS_SHIFT                      21           /**< Shift value for CMPBIAS */
#define _DEVINFO_USHFRCOCAL11_CMPBIAS_MASK                       0xE00000UL   /**< Bit mask for CMPBIAS */
#define _DEVINFO_USHFRCOCAL11_LDOHP_SHIFT                        24           /**< Shift value for LDOHP */
#define _DEVINFO_USHFRCOCAL11_LDOHP_MASK                         0x1000000UL  /**< Bit mask for LDOHP */
#define _DEVINFO_USHFRCOCAL11_CLKDIV_SHIFT                       25           /**< Shift value for CLKDIV */
#define _DEVINFO_USHFRCOCAL11_CLKDIV_MASK                        0x6000000UL  /**< Bit mask for CLKDIV */
#define _DEVINFO_USHFRCOCAL11_FINETUNINGEN_SHIFT                 27           /**< Shift value for FINETUNINGEN */
#define _DEVINFO_USHFRCOCAL11_FINETUNINGEN_MASK                  0x8000000UL  /**< Bit mask for FINETUNINGEN */
#define _DEVINFO_USHFRCOCAL11_VREFTC_SHIFT                       28           /**< Shift value for VREFTC */
#define _DEVINFO_USHFRCOCAL11_VREFTC_MASK                        0xF0000000UL /**< Bit mask for VREFTC */

/* Bit fields for DEVINFO USHFRCOCAL13 */
#define _DEVINFO_USHFRCOCAL13_MASK                               0xFFFF3F7FUL /**< Mask for DEVINFO_USHFRCOCAL13 */
#define _DEVINFO_USHFRCOCAL13_TUNING_SHIFT                       0            /**< Shift value for TUNING */
#define _DEVINFO_USHFRCOCAL13_TUNING_MASK                        0x7FUL       /**< Bit mask for TUNING */
#define _DEVINFO_USHFRCOCAL13_FINETUNING_SHIFT                   8            /**< Shift value for FINETUNING */
#define _DEVINFO_USHFRCOCAL13_FINETUNING_MASK                    0x3F00UL     /**< Bit mask for FINETUNING */
#define _DEVINFO_USHFRCOCAL13_FREQRANGE_SHIFT                    16           /**< Shift value for FREQRANGE */
#define _DEVINFO_USHFRCOCAL13_FREQRANGE_MASK                     0x1F0000UL   /**< Bit mask for FREQRANGE */
#define _DEVINFO_USHFRCOCAL13_CMPBIAS_SHIFT                      21           /**< Shift value for CMPBIAS */
#define _DEVINFO_USHFRCOCAL13_CMPBIAS_MASK                       0xE00000UL   /**< Bit mask for CMPBIAS */
#define _DEVINFO_USHFRCOCAL13_LDOHP_SHIFT                        24           /**< Shift value for LDOHP */
#define _DEVINFO_USHFRCOCAL13_LDOHP_MASK                         0x1000000UL  /**< Bit mask for LDOHP */
#define _DEVINFO_USHFRCOCAL13_CLKDIV_SHIFT                       25           /**< Shift value for CLKDIV */
#define _DEVINFO_USHFRCOCAL13_CLKDIV_MASK                        0x6000000UL  /**< Bit mask for CLKDIV */
#define _DEVINFO_USHFRCOCAL13_FINETUNINGEN_SHIFT                 27           /**< Shift value for FINETUNINGEN */
#define _DEVINFO_USHFRCOCAL13_FINETUNINGEN_MASK                  0x8000000UL  /**< Bit mask for FINETUNINGEN */
#define _DEVINFO_USHFRCOCAL13_VREFTC_SHIFT                       28           /**< Shift value for VREFTC */
#define _DEVINFO_USHFRCOCAL13_VREFTC_MASK                        0xF0000000UL /**< Bit mask for VREFTC */

/* Bit fields for DEVINFO USHFRCOCAL14 */
#define _DEVINFO_USHFRCOCAL14_MASK                               0xFFFF3F7FUL /**< Mask for DEVINFO_USHFRCOCAL14 */
#define _DEVINFO_USHFRCOCAL14_TUNING_SHIFT                       0            /**< Shift value for TUNING */
#define _DEVINFO_USHFRCOCAL14_TUNING_MASK                        0x7FUL       /**< Bit mask for TUNING */
#define _DEVINFO_USHFRCOCAL14_FINETUNING_SHIFT                   8            /**< Shift value for FINETUNING */
#define _DEVINFO_USHFRCOCAL14_FINETUNING_MASK                    0x3F00UL     /**< Bit mask for FINETUNING */
#define _DEVINFO_USHFRCOCAL14_FREQRANGE_SHIFT                    16           /**< Shift value for FREQRANGE */
#define _DEVINFO_USHFRCOCAL14_FREQRANGE_MASK                     0x1F0000UL   /**< Bit mask for FREQRANGE */
#define _DEVINFO_USHFRCOCAL14_CMPBIAS_SHIFT                      21           /**< Shift value for CMPBIAS */
#define _DEVINFO_USHFRCOCAL14_CMPBIAS_MASK                       0xE00000UL   /**< Bit mask for CMPBIAS */
#define _DEVINFO_USHFRCOCAL14_LDOHP_SHIFT                        24           /**< Shift value for LDOHP */
#define _DEVINFO_USHFRCOCAL14_LDOHP_MASK                         0x1000000UL  /**< Bit mask for LDOHP */
#define _DEVINFO_USHFRCOCAL14_CLKDIV_SHIFT                       25           /**< Shift value for CLKDIV */
#define _DEVINFO_USHFRCOCAL14_CLKDIV_MASK                        0x6000000UL  /**< Bit mask for CLKDIV */
#define _DEVINFO_USHFRCOCAL14_FINETUNINGEN_SHIFT                 27           /**< Shift value for FINETUNINGEN */
#define _DEVINFO_USHFRCOCAL14_FINETUNINGEN_MASK                  0x8000000UL  /**< Bit mask for FINETUNINGEN */
#define _DEVINFO_USHFRCOCAL14_VREFTC_SHIFT                       28           /**< Shift value for VREFTC */
#define _DEVINFO_USHFRCOCAL14_VREFTC_MASK                        0xF0000000UL /**< Bit mask for VREFTC */

/* Bit fields for DEVINFO CURRMON5V */
#define _DEVINFO_CURRMON5V_MASK                                  0x00000000UL /**< Mask for DEVINFO_CURRMON5V */

/** @} */
/** @} End of group EFM32GG12B_DEVINFO */
/** @} End of group Parts */
#ifdef __cplusplus
}
#endif

